[
  {
    "title": "Great if no support is needed",
    "description": "If you need support, you're out of luck. In both cases the experience was quite bad.Free: non-existent! Tickets are open for +7 days and reply despite follow ups.Paid:  After 2-3 days you get an auto-generated response.",
    "date": "2025-09-19",
    "reviewer_name": "Sigi Eisenreich",
    "rating": "2",
    "source": "Trustpilot",
    "country": "ES",
    "reviewer_total_reviews": "5reviews",
    "experience_date": "September 19, 2025",
    "is_unprompted": true
  },
  {
    "title": "Good but they should offer unlimited…",
    "description": "Good but they should offer unlimited Free Trial. History got deleted in free account now dont know how to recover",
    "date": "2025-09-15",
    "reviewer_name": "Amrit Roy",
    "rating": "3",
    "source": "Trustpilot",
    "country": "IN",
    "reviewer_total_reviews": "2reviews",
    "experience_date": "September 12, 2025",
    "is_unprompted": true
  },
  {
    "title": "Absolutely appalling and disrespectful…",
    "description": "Absolutely appalling and disrespectful customer service from Slack. Despite multiple follow-ups, they still haven’t bothered to respond—even though my messages were clearly opened days ago. There seems to be no other way to reach them, which makes the situation even worse.At this point, I’m seriously considering alternatives—does anyone know of a better platform that actually values its users?",
    "date": "2025-09-11",
    "reviewer_name": "Sam",
    "rating": "1",
    "source": "Trustpilot",
    "country": "GB",
    "reviewer_total_reviews": "4reviews",
    "experience_date": "September 2, 2025",
    "is_unprompted": true
  },
  {
    "title": "Great for team collaboration, but can get noisySlack makes team communication much…",
    "description": "Slack makes team communication much easier and helps cut down on endless email chains. I like how channels keep conversations organised and how well it integrates with other tools we use daily. That said, notifications can get overwhelming at times, and it takes some discipline to keep channels from becoming cluttered.",
    "date": "2025-09-05",
    "reviewer_name": "Matthew Dover",
    "rating": "4",
    "source": "Trustpilot",
    "country": "US",
    "reviewer_total_reviews": "1review",
    "experience_date": "July 10, 2025",
    "is_unprompted": false
  },
  {
    "title": "Still better than Teams",
    "description": "Better than Teams, emoji game is strong, but over time they've lost focus. Probably due to acquisition by Salesforce, which is understandable, but larger meeting support is needed.",
    "date": "2025-09-02",
    "reviewer_name": "Fred Lodge",
    "rating": "3",
    "source": "Trustpilot",
    "country": "US",
    "reviewer_total_reviews": "17reviews",
    "experience_date": "February 15, 2025",
    "is_unprompted": true
  },
  {
    "title": "Slack's alright",
    "description": "Slack's alright, but it's a bit clunky.  Finding specific files is a pain, and the search function isn't great.  Overpriced for what it offers, too.  Could do with some serious improvements.",
    "date": "2025-08-26",
    "reviewer_name": "Brendan Ludolph",
    "rating": "2",
    "source": "Trustpilot",
    "country": "AU",
    "reviewer_total_reviews": "2reviews",
    "experience_date": "August 7, 2025",
    "is_unprompted": true
  },
  {
    "title": "Nice app for employment",
    "description": "Nice app for employment. Exclusively for employee where you can talk privately without hindrances.",
    "date": "2025-08-25",
    "reviewer_name": "Zuzane Emradura",
    "rating": "5",
    "source": "Trustpilot",
    "country": "PH",
    "reviewer_total_reviews": "4reviews",
    "experience_date": "August 21, 2025",
    "is_unprompted": true
  },
  {
    "title": "Disappointed by Slack’s Handling of Privacy and Abuse Reports",
    "description": "I joined a Slack workspace and trusted the platform with my personal information, including my government-issued ID and contact details. Unfortunately, the workspace admin misused my data and shared it without my consent, which led to harassment and blackmail.Despite multiple reports to Slack’s abuse team, the response was slow and insufficient. Slack did eventually suspend the workspace, but only after significant harm had already occurred.I expect slack to be more transparent and I have a right to know who my data was given to without my consent.I expected better protection and faster action from a platform of Slack’s size and reputation. Users should be cautious about sharing sensitive information on Slack until they improve their verification and abuse response processes.",
    "date": "2025-08-09",
    "reviewer_name": "Shakeem",
    "rating": "1",
    "source": "Trustpilot",
    "country": "JM",
    "reviewer_total_reviews": "1review",
    "experience_date": "June 26, 2025",
    "is_unprompted": true
  },
  {
    "title": "reinstall every few days",
    "description": "It has been good for at least 5 years but lately everytime i switch on my PC, it seems connected but nobody is online. But the App on my Android works and people are online. I have to uninstall and reinstall the App on my PC. It seems like every few days I have to keep doing it. What happened?? #slack",
    "date": "2025-08-04",
    "reviewer_name": "Lisa How",
    "rating": "1",
    "source": "Trustpilot",
    "country": "MY",
    "reviewer_total_reviews": "2reviews",
    "experience_date": "August 4, 2025",
    "is_unprompted": true
  },
  {
    "title": "So bad",
    "description": "So bad!  One day I just can't log in and manage my team in my own business!! As it doesn't support older versions of Safari.  My Mac is as up to date as available but Slack just doesn't support it.  Tried everything.Can't even use the app on my Mac.  Can't use in browser.  What the hell.  I have to run out and buy a new Mac just to manage my team and the months/ years of stuff we've set up in Slack.I'm now forced to manage from my phone.Such terrible service.",
    "date": "2025-07-31",
    "reviewer_name": "Jacqueline",
    "rating": "1",
    "source": "Trustpilot",
    "country": "AU",
    "reviewer_total_reviews": "2reviews",
    "experience_date": "July 31, 2025",
    "is_unprompted": true
  },
  {
    "title": "Wanted one month only bill and they…",
    "description": "Wanted one month only bill and they charged my for 1 year. No visible way to cancel the billing, app chaotic. Never again",
    "date": "2025-07-10",
    "reviewer_name": "btogkas1",
    "rating": "1",
    "source": "Trustpilot",
    "country": "GR",
    "reviewer_total_reviews": "9reviews",
    "experience_date": "July 10, 2025",
    "is_unprompted": true
  },
  {
    "title": "Used to be a fan. Personal data held for ransom!",
    "description": "Used to be a fan.. AVOID LIKE THE PLAGUEI used to be on the pro plan for a few years. My usage reduced so I switched to the free plan thinking my data is still accessible.Received an email today essentially saying, upgrade or we'll delete your data.No way to export all the data.Literally holding my data hostage.. I won't be upgrading but i will be warning others to stay away..",
    "date": "2025-07-08",
    "reviewer_name": "RandomGuy",
    "rating": "1",
    "source": "Trustpilot",
    "country": "GB",
    "reviewer_total_reviews": "12reviews",
    "experience_date": "July 8, 2025",
    "is_unprompted": true
  },
  {
    "title": "functioning worse over time",
    "description": "functioning worse over time, website doesn't open the app/actual messaging properly for me anymore",
    "date": "2025-05-23",
    "reviewer_name": "Nathanael Pulver",
    "rating": "1",
    "source": "Trustpilot",
    "country": "US",
    "reviewer_total_reviews": "1review",
    "experience_date": "May 23, 2025",
    "is_unprompted": true
  },
  {
    "title": "Reveals your email address by default",
    "description": "And makes it hard (impossible?) to hide your email address. I never should have trusted them with my real email address! And of course, I can't even replace my Slack email address with another one!",
    "date": "2025-05-13",
    "reviewer_name": "xr",
    "rating": "1",
    "source": "Trustpilot",
    "country": "FR",
    "reviewer_total_reviews": "26reviews",
    "experience_date": "May 13, 2025",
    "is_unprompted": true
  },
  {
    "title": "It became a horrible cash-grab",
    "description": "It became a horrible cash-grab. I used to like slack but its latest techniques of trying to make you upgrade at all costs make it unusable. I have been invited to join an external channel and for that it asked me to upgrade and pay a subscription just to access a single channel that I rarely use.",
    "date": "2025-04-22",
    "reviewer_name": "Alexndru Vlas",
    "rating": "1",
    "source": "Trustpilot",
    "country": "AU",
    "reviewer_total_reviews": "13reviews",
    "experience_date": "April 1, 2025",
    "is_unprompted": true
  },
  {
    "title": "Very good app, great service.",
    "description": "Very good app, great service. I'd give 5 stars if some basic things get sorted like microphone is always muted when you call from cell phone, doesn't make sense.",
    "date": "2025-04-10",
    "reviewer_name": "Matija",
    "rating": "4",
    "source": "Trustpilot",
    "country": "HR",
    "reviewer_total_reviews": "5reviews",
    "experience_date": "April 8, 2025",
    "is_unprompted": false
  },
  {
    "title": "The ABSOLUTE WORST",
    "description": "The ABSOLUTE WORST! Difficult to use, difficult to understand, takes hours learning curve and RARELY works!",
    "date": "2025-03-27",
    "reviewer_name": "Brett Stephenson",
    "rating": "1",
    "source": "Trustpilot",
    "country": "US",
    "reviewer_total_reviews": "3reviews",
    "experience_date": "March 25, 2025",
    "is_unprompted": true
  },
  {
    "title": "I was working on Slack for 7 years",
    "description": "I was working on Slack for 7 years, and recently it started to glitch and deleted all my conversations! Not recommend",
    "date": "2025-03-20",
    "reviewer_name": "Vivek",
    "rating": "2",
    "source": "Trustpilot",
    "country": "IN",
    "reviewer_total_reviews": "1review",
    "experience_date": "March 7, 2025",
    "is_unprompted": true
  },
  {
    "title": "This has been the worst 7 weeks of…",
    "description": "This has been the worst 7 weeks of trying to get access to an account. Dishonest sales reps who went MIA after they said they couldn't do what they promised. The app is super buggy and there is NO customer service. Salesforce seems to barely know they own Slack and it all goes to a email support team who goes back and forth and gets nothing done. I am looking for an alternative after 3 years of being with them because this is absolutely terrible.",
    "date": "2025-03-17",
    "reviewer_name": "Jennifer Esteban",
    "rating": "1",
    "source": "Trustpilot",
    "country": "US",
    "reviewer_total_reviews": "1review",
    "experience_date": "March 17, 2025",
    "is_unprompted": true
  },
  {
    "title": "What is WRONG with Slack.",
    "description": "What is WRONG with Slack.REGULARLY when I send a MESSAGE - especially VOICE messages,The message is all of a sudden DELETED!!! - everything I wrote is GONE.Today I just recorded a long voice message, where I explained to my team what to do,Then I click send,instead of sending it I get a notification: \"your message and voice message have been saved as draft\"then I click on my drafts, SEND it,And the ENTIRE VOICE MESSAGE is GONE.WHY is your buggy app constantly FAILING to do the ONE job it has to do?Compare this to a SIMPLE app that is 100% and ALWAYS working -> like text-edit on my computer.EVen if my computer CRASHES, all files are ALWAYS 100% saved, I have never - not ONCE in 10 years of working with this app - lost a file!and that is a FREE app.Why can't you guys get this handled?! - we're paying you a LOT of money, each month.",
    "date": "2025-03-09",
    "reviewer_name": "Bernd",
    "rating": "1",
    "source": "Trustpilot",
    "country": "US",
    "reviewer_total_reviews": "9reviews",
    "experience_date": "March 9, 2025",
    "is_unprompted": true
  },
  {
    "title": "Since Salesforce took over Slack it has…",
    "description": "Since Salesforce took over Slack it has gone downhill big time. There are now permanent ads all over the app that block functionality. Just absolute trash. Salesforce itself, as a side note, is the worst CRM ever made, so its no wonder they have ruined Slack.",
    "date": "2025-01-21",
    "reviewer_name": "Jeff Stern",
    "rating": "1",
    "source": "Trustpilot",
    "country": "US",
    "reviewer_total_reviews": "48reviews",
    "experience_date": "January 10, 2025",
    "is_unprompted": true
  },
  {
    "title": "I cannot believe how retarded is this",
    "description": "I cannot believe how retarded is this. I am part of few organizations that are free. And one that is paid. I am part of the free ones for years. The paid one invited me as external connection. After some time i got removed from the group by slack because I need to purchase paid account. It was 50% off for the first months or $4.49 something per month. It wanted to charge me around $8.99 the first month. Several times i refreshed and same thing happened.2 days later I purchased, but now it charged me $6,99, still not $4.49 lolBut I had to pay and then I joined the paid organization.Now when I go back to the free ones to see 90+ days chat it says that I do not have paid account.",
    "date": "2025-01-20",
    "reviewer_name": "Aleksandar Atanasoski",
    "rating": "1",
    "source": "Trustpilot",
    "country": "MK",
    "reviewer_total_reviews": "3reviews",
    "experience_date": "January 16, 2025",
    "is_unprompted": true
  },
  {
    "title": "You won’t find worse support",
    "description": "Dishonest sales reps.  Rigid contracts.  Absolute no support or training.  Slack and sales force are not for small business.   One of the biggest regrets I’ve had is signing up with their enterprise sales team.  They are dishonest and unhelpful.",
    "date": "2025-01-19",
    "reviewer_name": "Unhappy with ZR",
    "rating": "1",
    "source": "Trustpilot",
    "country": "US",
    "reviewer_total_reviews": "2reviews",
    "experience_date": "January 1, 2025",
    "is_unprompted": true
  },
  {
    "title": "Continues to charge me for old inactive channel with no one on it even, no option to downgrade, and even after contacting support to stop charges",
    "description": "My client created a slack channel awhile back and after dealing with the over engineered UI, we decided to use something more transparent. Since then the channel had been deactivated by the organization and I am still getting charged even though there are no active users, additionally there is nowhere to downgrade, AND I contacted customer support about it a month ago and they continue to charge me anyways. Why cant companies create products people want to use instead of just scamming people for profit? I've contacted my credit card company to dispute the charges, next step is a new ordering a new card since they are determined to continue charging me despite not using the service and my requests. I noticed several others on reddit with the same experience.",
    "date": "2025-01-05",
    "reviewer_name": "Avery Quinn",
    "rating": "1",
    "source": "Trustpilot",
    "country": "US",
    "reviewer_total_reviews": "3reviews",
    "experience_date": "January 4, 2025",
    "is_unprompted": true
  }
]